/*====*====*====*====*====*====*====*====*====*====*====*====*====*====*====*


           TOUCH DEVICE DRIVER FUNCTIONS

GENERAL DESCRIPTION

  CYPRESS TMA300 Touch Device ODM Driver

EXTERNALIZED FUNCTIONS



INITIALIZATION AND SEQUENCING REQUIREMENTS

*====*====*====*====*====*====*====*====*====*====*====*====*====*====*====*/

/*===========================================================================
                        EDIT HISTORY FOR MODULE

Date			Author				Descriptions
----------		-----------			------------------------------------
2010/03/12		taewan.kim			code create (basic operation implement)
2010/04/27		joseph.jung			multi touch implement
2010/05/17		joseph.jung			power control function is changed
2010/06/30		joseph.jung			adapt for designated star panel
2010/06/30		joseph.jung			I/O power control implement for Rev.B


===========================================================================*/


/*===========================================================================

                     INCLUDE FILES FOR ODM DRIVER

===========================================================================*/


#include "nvodm_touch_int.h"
#include "nvodm_services.h"
#include "nvodm_touch_cypress.h"
#include "nvodm_query_discovery.h"

#include "../../adaptations/pmu/max8907/max8907_supply_info_table.h"



////////////////////////////////////////////////////////////////////
/////////////       Cypress Environment Define       ///////////////
////////////////////////////////////////////////////////////////////


#define CYPRESS_TOUCH_DEVICE_GUID				NV_ODM_GUID('c','y','p','t','o','u','c','h')

#define CYPRESS_I2C_SPEED_KHZ					400
#define CYPRESS_I2C_TIMEOUT						500
#define CYPRESS_LOW_SAMPLE_RATE					0		//40 reports per-second
#define CYPRESS_HIGH_SAMPLE_RATE				1		//80 reports per-second

#define CYPRESS_SCREEN_ANGLE_MODE				1		//0=Landscape, 1=Portrait

#define CYPRESS_POR_DELAY_MS					100		//Dealy after Power-On Reset

#define CYPRESS_DEBOUNCE_TIME_MS				0

#define CYPRESS_FINGER_MAX						4

#define CYPRESS_MODE_BOOTLOADER					0		// default mode
#define CYPRESS_MODE_OPERATION					1

#undef CYPRESS_SUPPORT_FW_UPGRADE
#undef CYPRESS_SUPPORT_CAL


////////////////////////////////////////////////////////////////////
///////////////        Cypress EVENT Define       //////////////////
////////////////////////////////////////////////////////////////////

#define CYPRESS_MOVEMENT_THRESHOLD				0//3

////////////////////////////////////////////////////////////////////
///////////////  Cypress Control & Data Register  //////////////////
////////////////////////////////////////////////////////////////////

#define CYPRESS_BL_FILE_REG						0x00

#define CYPRESS_HST_MODE_REG					0x00
#define CYPRESS_TT_STAT_REG						0x02


////////////////////////////////////////////////////////////////////
//////////////////  Cypress Data from Register  ////////////////////
////////////////////////////////////////////////////////////////////


#define TS_SNTS_GET_X_POSITION(high_reg, low_reg) \
		((int)(high_reg*0x100) + (int)(low_reg))
#define TS_SNTS_GET_Y_POSITION(high_reg, low_reg) \
		((int)(high_reg*0x100) + (int)(low_reg))

////////////////////////////////////////////////////////////////////
/////////////////   Data Structure for Cypress   ///////////////////
////////////////////////////////////////////////////////////////////

typedef struct
{
#if 1
	NvU8 tt_stat;					// 0x02
	
	NvU8 touch_1_X_high_position;	// 0x03
	NvU8 touch_1_X_low_position;	// 0x04
	NvU8 touch_1_Y_high_position;	// 0x05
	NvU8 touch_1_Y_low_position;	// 0x06
	NvU8 touch_1_Z_value;			// 0x07
	
	NvU8 touch_1_2_ID;				// 0x08
	
	NvU8 touch_2_X_high_position;	// 0x09
	NvU8 touch_2_X_low_position;	// 0x0A
	NvU8 touch_2_Y_high_position;	// 0x0B
	NvU8 touch_2_Y_low_position;	// 0x0C
	NvU8 touch_2_Z_value;			// 0x0D

	NvU8 gesture_count;				// 0x0E
	NvU8 gesture_ID;				// 0x0F

	NvU8 touch_3_X_high_position;	// 0x10
	NvU8 touch_3_X_low_position;	// 0x11
	NvU8 touch_3_Y_high_position;	// 0x12
	NvU8 touch_3_Y_low_position;	// 0x13
	NvU8 touch_3_Z_value;			// 0x14

	NvU8 touch_3_4_ID;				// 0x15

	NvU8 touch_4_X_high_position;	// 0x16
	NvU8 touch_4_X_low_position;	// 0x17
	NvU8 touch_4_Y_high_position;	// 0x18
	NvU8 touch_4_Y_low_position;	// 0x19
	NvU8 touch_4_Z_value;			// 0x1A
#else
	NvU8 tt_stat;					// 0x02

	NvU8 touch_info[10][9];			// 0x03~0x5C
	/*
	touch_info[i][0]: ith x position high
	touch_info[i][1]: ith x position low
	touch_info[i][2]: ith y position high
	touch_info[i][3]: ith y position low
	touch_info[i][4]: ith z value (pressure)
	touch_info[i][5]: ith ID
	touch_info[i][6]: ith Gesture
	touch_info[i][7]: ith distance high
	touch_info[i][8]: ith distance low
	*/

	NvU8 hover_x_high;				// 0x5D
	NvU8 hover_x_low;				// 0x5E
	NvU8 hover_y_high;				// 0x5F
	NvU8 hover_y_low;				// 0x60
	NvU8 hover_gesture;				// 0x61

	NvU8 proximity_left_right;		// 0x62
	NvU8 proximity_top_bottom;		// 0x63

	NvU8 button[2];					// 0x64~0x65
#endif
} cypress_ts_sensor_data;


typedef	struct
{
	NvU8 finger_ID[CYPRESS_FINGER_MAX]; 
	NvU32 X_position[CYPRESS_FINGER_MAX];
	NvU32 Y_position[CYPRESS_FINGER_MAX];
	NvU8 pressure[CYPRESS_FINGER_MAX];
} cypress_ts_finger_data;


typedef struct Cypress_TouchDeviceRec
{
    NvOdmTouchDevice OdmTouch;
    NvOdmTouchCapabilities Caps;
    NvOdmServicesI2cHandle hOdmI2c;
    NvOdmServicesGpioHandle hGpio;
    NvOdmServicesPmuHandle hPmu;
    NvOdmGpioPinHandle hPin;
    NvOdmServicesGpioIntrHandle hGpioIntr;
    NvOdmOsSemaphoreHandle hIntSema;
    NvU32 DeviceAddr;
    NvU32 SampleRate;
    NvU8 SleepMode;
    NvBool PowerOn;
    NvU32 VddId;    
    NvU8 ChipFirmVersion;                          
    NvU32 I2cClockSpeedKHz;
} Cypress_TouchDevice;


static const NvOdmTouchCapabilities Cypress_Capabilities =
{
    1, //IsMultiTouchSupported
    2, //MaxNumberOfFingerCoordReported;
    0, //IsRelativeDataSupported
