/*====*====*====*====*====*====*====*====*====*====*====*====*====*====*====*


           TOUCH DEVICE DRIVER FUNCTIONS

GENERAL DESCRIPTION

  SYNAPTICS T1320 Touch Device ODM Driver

EXTERNALIZED FUNCTIONS



INITIALIZATION AND SEQUENCING REQUIREMENTS

*====*====*====*====*====*====*====*====*====*====*====*====*====*====*====*/

/*===========================================================================
                        EDIT HISTORY FOR MODULE

Date			Author				Descriptions
----------		-----------			------------------------------------
2010/03/12		taewan.kim			code create (basic operation implement)
2010/04/02		joseph.jung			multi touch operation support
2010/04/13		joseph.jung			touch f/w upgrade support
2010/05/31		joseph.jung			adapt for designated star panel
2010/06/17		joseph.jung			interrupt recognize from falling edge to
									active low
									

===========================================================================*/

/*===========================================================================

                     INCLUDE FILES FOR ODM DRIVER

===========================================================================*/


#include "nvodm_touch_int.h"
#include "nvodm_services.h"
#include "nvodm_query_discovery.h"
#include "nvodm_touch_synaptics.h"
#include "nvos.h"


// 20100413  for Touch Firmware Upgrade [START]
#include "synaptics_ts_firmware.h"
// 20100413  for Touch Firmware Upgrade [END]



#define SYNAPTICS_MIN_FLICK_SPEED_REG			0x9E

#define SYNAPTICS_RMI_QUERY_BASE_REG			0xE3
#define SYNAPTICS_RMI_CMD_BASE_REG				0xE4
#define SYNAPTICS_FLASH_QUERY_BASE_REG			0xE9
#define SYNAPTICS_FLASH_DATA_BASE_REG			0xEC

// 20100929  Ghost finger solution = touch f/w [START]
#define SYNAPTICS_MELT_CONTROL_REG				0xF0

#define SYNAPTICS_NO_MELT_MODE					0
#define SYNAPTICS_MELT_MODE						1<<0
#define SYNAPTICS_AUTO_MELT_MODE				1<<1
// 20100929  Ghost finger solution = touch f/w [END]

#define SYNAPTICS_INT_FLASH						1<<0
#define SYNAPTICS_INT_STATUS 					1<<1
#define SYNAPTICS_INT_ABS0 						1<<2

#define SYNAPTICS_DEVICE_NORMAL_OPERATION		0
#define SYNAPTICS_DEVICE_SENSOR_SLEEP			1


#ifdef SYNAPTICS_SUPPORT_FW_UPGRADE
//  Constants
#define SYNAPTICS_FLASH_CMD_FW_CRC				0x01
#define SYNAPTICS_FLASH_CMD_FW_WRITE			0x02
#define SYNAPTICS_FLASH_CMD_ERASEALL			0x03
#define SYNAPTICS_FLASH_CMD_CONFIG_READ			0x05
#define SYNAPTICS_FLASH_CMD_CONFIG_WRITE		0x06
#define SYNAPTICS_FLASH_CMD_CONFIG_ERASE		0x07
#define SYNAPTICS_FLASH_CMD_ENABLE				0x0F
#define SYNAPTICS_FLASH_NORMAL_RESULT			0x80
#endif /* SYNAPTICS_SUPPORT_FW_UPGRADE */

////////////////////////////////////////////////////////////////////
////////////////// Synaptics Data from Register ////////////////////
////////////////////////////////////////////////////////////////////

// 20100319  Positon Conversion : Panel resolution -> LCD resolution [START]
#ifdef FEATURE_LGE_TOUCH_CUSTOMIZE
// convert reported coordinates, X : 1036 -> 479, Y : 1681 -> 799 (1728 -> 903)
#define TS_SNTS_GET_X_POSITION(high_reg, low_reg) \
		( ((int)((high_reg << 4) & 0x000007F0) | (int)(low_reg&0x0F)) * (LGE_TOUCH_RESOLUTION_X - 1) / 1036)
#define TS_SNTS_GET_Y_POSITION(high_reg, low_reg) \
		( ((int)((high_reg << 4) & 0x000007F0) | (int)((low_reg >> 4) & 0x0F)) * (LGE_TOUCH_RESOLUTION_Y - 1) / 1728)
#else
#define TS_SNTS_GET_X_POSITION(high_reg, low_reg) \
		((int)((high_reg << 4) & 0x000007F0) | (int)(low_reg&0x0F))
#define TS_SNTS_GET_Y_POSITION(high_reg, low_reg) \
		((int)((high_reg << 4) & 0x000007F0) | (int)((low_reg >> 4) & 0x0F))
#endif /* FEATURE_LGE_TOUCH_CUSTOMIZE */
// 20100319  Positon Conversion : Panel resolution -> LCD resolution [END]

#define TS_SNTS_HAS_PINCH(gesture_reg) \
		((gesture_reg&0x40)>>6)
#define TS_SNTS_HAS_PRESS(gesture_reg) \
		((gesture_reg&0x20)>>5)
#define TS_SNTS_HAS_FLICK(gesture_reg) \
		((gesture_reg&0x10)>>4)
#define TS_SNTS_HAS_DOUBLE_TAP(gesture_reg) \
		((gesture_reg&0x04)>>2)

#define TS_SNTS_GET_REPORT_RATE(device_control_reg) \
		((device_control_reg&0x40)>>6)
// 1st bit : '0' - Allow sleep mode, '1' - Full power without sleeping
// 2nd and 3rd bit : 0x00 - Normal Operation, 0x01 - Sensor Sleep
#define TS_SNTS_GET_SLEEP_MODE(device_control_reg) \
		(device_control_reg&0x07)


////////////////////////////////////////////////////////////////////
/////////////////  Data Structure for Synaptics  ///////////////////
////////////////////////////////////////////////////////////////////

typedef struct
{
	NvU8 device_status_reg;						//0x13
	NvU8 interrupt_status_reg;					//0x14
	NvU8 finger_state_reg[3];					//0x15~0x17

	NvU8 fingers_data[SYNAPTICS_FINGER_MAX][5];	//0x18 ~ 0x49
	/* 5 data per 1 finger, support 10 fingers data
	fingers_data[x][0] : xth finger's X high position
	fingers_data[x][1] : xth finger's Y high position
	fingers_data[x][2] : xth finger's XY low position
	fingers_data[x][3] : xth finger's XY width
	fingers_data[x][4] : xth finger's Z (pressure)
	*/
	// Etc...
	NvU8 gesture_flag0;							//0x4A
	NvU8 gesture_flag1;							//0x4B
	NvU8 pinch_motion_X_flick_distance;			//0x4C
	NvU8 rotation_motion_Y_flick_distance;		//0x4D
	NvU8 finger_separation_flick_time;			//0x4E
} synaptics_ts_sensor_data;

typedef struct {
	NvU32 X_position[SYNAPTICS_FINGER_MAX];
	NvU32 Y_position[SYNAPTICS_FINGER_MAX];
	NvU8 width[SYNAPTICS_FINGER_MAX];
	NvU8 pressure[SYNAPTICS_FINGER_MAX];
} synaptics_ts_finger_data;


typedef struct Synaptics_TouchDeviceRec
{
    NvOdmTouchDevice OdmTouch;
    NvOdmTouchCapabilities Caps;
    NvOdmServicesI2cHandle hOdmI2c;
    NvOdmServicesGpioHandle hGpio;
    NvOdmServicesPmuHandle hPmu;
    NvOdmGpioPinHandle hPin;
    NvOdmServicesGpioIntrHandle hGpioIntr;
    NvOdmOsSemaphoreHandle hIntSema;
    NvU32 DeviceAddr;
	NvU32 I2CInstance;
    NvU32 GpioPort;
    NvU32 GpioPin;
    NvU32 SampleRate;
    NvU32 SleepMode;
    NvBool PowerOn;
    NvU32 CoreVddId;
	NvU32 I2cVddId;
	NvU8 FirmwareRevId;
    NvU32 I2cClockSpeedKHz;
// 20100929  Ghost finger solution = touch f/w [START]
	NvU8 MeltType;
// 20100929  Ghost finger solution = touch f/w [START]
} Synaptics_TouchDevice;


